Revit 2024 API
StructuralConnectionHandler Class
 An object of Structural Connection Handler.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class StructuralConnectionHandler : Element
Visual Basic
Public Class StructuralConnectionHandler _
	Inherits Element
Visual C++
public ref class StructuralConnectionHandler : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.StructuralConnectionHandler
See Also
StructuralConnectionHandler Members
Autodesk.Revit.DB.Structure Namespace